app/Http/Controllers/HomeController.php

select * from `Slide`
select * from `loai_sanpham`
---
    function __construct()
    {
        $theloai = TheLoai::all();
        $slide = Slide::all();
        $sanphamall = ChiTietSanPham::all();